namespace ConferenceBooking.Application.DTOs.Halls;

/// <summary>
/// Клас запиту для отримання доступних залів конференцій. Містить інформацію про початковий та кінцевий час бронювання, а також мінімальну місткість залу.
/// </summary>
public class AvailableHallsRequest
{
    /// <summary>
    /// Початковий час бронювання. Містить значення типу DateTime, яке вказує на початок періоду, протягом якого користувач хоче забронювати зал.
    /// </summary>
    public DateTime StartTime { get; set; }

    /// <summary>
    /// Кінцевий час бронювання. Містить значення типу DateTime, яке вказує на кінець періоду, протягом якого користувач хоче забронювати зал.
    /// </summary>
    public DateTime EndTime { get; set; }

    /// <summary>
    /// Мінімальна місткість залу. Містить числове значення, яке вказує на мінімальну кількість людей, які можуть перебувати у залі одночасно.
    /// </summary>
    public int Capacity { get; set; }
}