namespace ConferenceBooking.Application.DTOs.Halls;

/// <summary>
/// Клас запиту для оновлення інформації про зал конференцій. Містить інформацію про назву залу, його місткість, погодинну ставку та список ідентифікаторів послуг, які надаються у цьому залі.
/// </summary>
public class UpdateHallRequest
{
    /// <summary>
    /// Назва залу конференцій. Містить текстове значення, яке описує зал.
    /// </summary>
    public string Name { get; set; } = string.Empty;

    /// <summary>
    /// Місткість залу конференцій. Містить числове значення, яке вказує на максимальну кількість людей, які можуть перебувати у залі одночасно.
    /// </summary>
    public int Capacity { get; set; }

    /// <summary>
    /// Погодинна ставка за використання залу конференцій. Містить числове значення, яке вказує на вартість оренди залу за годину.
    /// </summary>
    public decimal HourlyRate { get; set; }

    /// <summary>
    /// Перелік ідентифікаторів послуг, які надаються у цьому залі конференцій. Містить список унікальних ідентифікаторів (Guid) для кожної послуги.
    /// </summary>
    public List<Guid> ServiceIds { get; set; } = new();
}