namespace ConferenceBooking.Application.DTOs.Bookings;

/// <summary>
/// Клас запиту для створення бронювання. Містить інформацію про ідентифікатор залу, початковий та кінцевий час бронювання, а також список ідентифікаторів послуг, які користувач хоче додати до бронювання.
/// </summary>
public class CreateBookingRequest
{
    /// <summary>
    /// Guid Id залу. Містить унікальний ідентифікатор типу Guid, який використовується для ідентифікації конкретного залу, який користувач хоче забронювати.
    /// </summary>
    public Guid HallId { get; set; }

    /// <summary>
    /// Початковий час бронювання. Містить значення типу DateTime, яке вказує на початок періоду, протягом якого користувач хоче забронювати зал.
    /// </summary>
    public DateTime StartTime { get; set; }

    /// <summary>
    /// Кінцевий час бронювання. Містить значення типу DateTime, яке вказує на кінець періоду, протягом якого користувач хоче забронювати зал.
    /// </summary>
    public DateTime EndTime { get; set; }

    /// <summary>
    /// Список ідентифікаторів послуг. Містить колекцію унікальних ідентифікаторів типу Guid, які представляють послуги, які користувач хоче додати до бронювання. За замовчуванням встановлено порожній список.
    /// </summary>
    public List<Guid> ServiceIds { get; set; } = new();
}
